---
kind: type
id: T:Autodesk.Revit.DB.FabricationConfiguration
source: html/f7094105-2acf-03f1-7a7f-82dd24087a17.htm
---
# Autodesk.Revit.DB.FabricationConfiguration

This element contains the information about the fabrication configuration settings used by the project.

## Syntax (C#)
```csharp
public class FabricationConfiguration : Element
```

## Remarks
The element provides information about the location of the fabrication database, its properties, and settings related to fabrication items.